name: "deoldify_ensemble"
platform: "ensemble"
input: [
{
    name: "input_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
}
]
output: [
{
    name: "output_image"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
}
]
ensemble_scheduling {
    step [
        {
            model_name: "deoldify_preprocessing"
            model_version: -1
            input_map {
                key: "deoldify_preprocessing_input"
                value: "input_image"
            }
            output_map {
                key: "deoldify_preprocessing_output"
                value: "preprocessed_image"
            }
        },
        {
            model_name: "deoldify"
            model_version: -1
            input_map {
                key: "input"
                value: "preprocessed_image"
            }
            output_map {
                key: "out"
                value: "colored_image"
            }
        },
        {
            model_name: "deoldify_postprocessing"
            model_version: -1
            input_map {
                key: "deoldify_postprocessing_input"
                value: "colored_image"
            }
            output_map {
                key: "deoldify_postprocessing_output"
                value: "output_image"
            }
        }
    ]
}