name: "deoldify_preprocessing"
backend: "python"
input: [
{
    name: "deoldify_preprocessing_input"
    data_type: TYPE_UINT8
    dims: [-1, -1, 3]
}
]

output [
{
    name: "deoldify_preprocessing_output"
    data_type: TYPE_FP32
    dims: [1, 3, 256, 256]
}
]

instance_group [
{
    count: 1
    kind: KIND_CPU
}
]
